eksempel/ebxml/ebxml-eksempel.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- Edited 2017-08-15: 
		- Fixed the placement of eb:AckRequested and ds:Signature elements, moved them from within the eb:MessageHeader 
		- Fixed eb:AckRequested "soap:mustUnderstand" -> "SOAP:mustUnderstand" 
		- Fixed eb:signed="0" -> eb:signed="1" 
	Edited 2018-03-08 TTR:
		- Fixed the bug in msgheader-2_0.xsd by removing the ###other element not used by us
		- Fixed the Epikrise send -> Epikrisesender
		- Made scemaLocation point to the local copy of msg-header-2_0.xsd
	Edited 2018-10-02 TTR:
		- Removed one HER id from PartyId, only one of each id-type is allowed
-->
<SOAP:Envelope xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://www.oasis-open.org/committees/ebxml-msg/schema/envelope.xsd">
	<SOAP:Header xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" xsi:schemaLocation="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd msg-header-2_0.xsd">
		<eb:MessageHeader SOAP:mustUnderstand="1" eb:version="2.0">
			<eb:From>
				<eb:PartyId eb:type="HER">987654</eb:PartyId>
				<eb:PartyId eb:type="ENH">545345434</eb:PartyId>
				<eb:Role>EPIKRISEsender</eb:Role>
			</eb:From>
			<eb:To>
				<eb:PartyId eb:type="HER">12345</eb:PartyId>
				<eb:PartyId eb:type="ENH">934343432</eb:PartyId>
				<eb:Role>EPIKRISEreceiver</eb:Role>
			</eb:To>
			<eb:CPAId>KITH-GenericCPAId</eb:CPAId>
			<eb:ConversationId>774a6ed1-76dd-4f89-9239-6ed3c1bd7caf</eb:ConversationId>
			<eb:Service>EPIKRISE-S</eb:Service>
			<eb:Action>EPIKRISE</eb:Action>
			<eb:MessageData>
				<eb:MessageId> 955536cb-fb9a-49d9-848d-2baca7b116e1</eb:MessageId>
				<eb:Timestamp>2006-07-11T12:45:32</eb:Timestamp>
			</eb:MessageData>
			<eb:DuplicateElimination/>
		</eb:MessageHeader>
		<eb:AckRequested eb:version="2.0" SOAP:mustUnderstand="1" eb:signed="1"/>
		<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
					<ds:Reference URI="">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
							<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
						<ds:DigestValue>RJ2QdODr5ADUs9RAR9aT8NFdqds=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="cid:ebxhmpayload111@example.com">
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
						<ds:DigestValue>j1BG/SCN4Z74inL530u2SYGWKtE=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>
ZRLxNWAWqxvW1d9vdtZhQ3cII02NhUk7H8ugAML0cIrP0noebUMikAOuX6fNIVTvi4kLAeb3FfQq
BJD6heRWrM0lMZsA0rIHVOtH3fc6JqwUWRuiS9zzuKIx5ah8O0yU1ZkeS5b6fTJtX36+idO5KvTZ
c2az7fpWhPLcrfcyT4A=
				</ds:SignatureValue>
				<ds:KeyInfo>
					<ds:X509Data>
						<ds:X509Certificate>
MIIDLjCCAhagAwIBAgIGAO75BUawMA0GCSqGSIb3DQEBBAUAMGQxCzAJBgNVBAYTAkVVMRAwDgYD
VQQKEwdQQVBJTkVUMRkwFwYDVQQLExBDZW50cmFsIFNlcnZpY2VzMSgwJgYDVQQDEx9QQVBJTkVU
IENlcnRpZmljYXRpb24gQXV0aG9yaXR5MB4XDTAyMDcxMTA5MzQ0OVoXDTAzMDcxMTA5MzQ0OVow
VDELMAkGA1UEBhMCREUxFTATBgNVBAoTDFNFRUJVUkdFUiBBRzERMA8GA1UECxMIUmVzZWFyY2gx
GzAZBgNVBAMTElNFRUJVUkdFUl9SZXNlYXJjaDCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEA
x18IyJhQIoQdBYvRQflIr8D2IhFh2KPAJY6oSDoKytxZ+llH83yiU6TK/w6sYAdQzCBVL+wwM5Gg
/1jC0aM7+OYO+o7Po0mrVo7qSVF2R6467gR46TunQ+lEKePcjwSnRLXyqe4clBAKfcIjjJOHdJKZ
ugyTfl3yhk1Oof4/3S0CAwEAAaN6MHgwHwYDVR0jBBgwFoAUOhZxtfVaQrBKkpXg4EdpACiBJdEw
VQYDVR0RBE4wTIFKRS1tYWlsOiBjLmZyYW5rQHNlZWJ1cmdlci5kZSwgVGVsOiArNDkoMCk3MjUy
OTYxMTg1LCBGYXg6ICs0OSgwKTcyNTI5NjI0MDAwDQYJKoZIhvcNAQEEBQADggEBACF7qqnHJSUx
siSQcPZxLMlOVv8OLP8IxPOpxFVSt98bhmMDC+AJwL2tlX4Q3uQGI6lfu26bO9RqELS26gVpYQej
Vs+NNwGipV2S3VqJXz5C/Ge6EFnFgPfX060QE0krJCq+d9GPYllnrbA5VaEVw3ihgPhX8jali/Qx
cDPYmqUJXaqFLHmm1OCmcCiTPqXhWnhmYTm0pTGRdlrFEWyGjTEOunvOjn8mjvD6wcYOAp91cPE5
gTCCRm5tsGmxNPyL/CQthztAsuLeWMupeWidqLwpOxQiW3UKqG0yf3LdbsQ20sgBAdM2T8Gsw2ZN
0iDbd7xWIDn1Vy2mYfAHaRs6VSQ=
</ds:X509Certificate>
					</ds:X509Data>
				</ds:KeyInfo>
			</ds:Signature>
	</SOAP:Header>
	<SOAP:Body xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" xsi:schemaLocation="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd">
		<eb:Manifest eb:version="2.0">
			<eb:Reference xlink:href="cid:ebxmlpayload111@example.com" xlink:role="XLinkRole" xlink:type="simple">
				<eb:Description xml:lang="no">Epikrise</eb:Description>
			</eb:Reference>
		</eb:Manifest>
	</SOAP:Body>
</SOAP:Envelope>
